tracker_of_wildlife/app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
    def index
        animals = Animal.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        animal = Animal.find(params[:id])

INSERT INTO "animals" ("common_name", "latin_name", "kingdom", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["common_name", "Emperor Penguin"], ["latin_name", "Aptenodytes forsteri"], ["kingdom", "Animalia"], ["created_at", "2020-08-05 21:49:13.701478"], ["updated_at", "2020-08-05 21:49:13.701478"]]
---
    def create
        animal = Animal.create(animal_params)

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "animals" SET "common_name" = $1, "updated_at" = $2 WHERE "animals"."id" = $3  [["common_name", "Tigerrrr"], ["updated_at", "2020-08-05 23:43:56.046245"], ["id", 1]]
---
    def update
        animal = Animal.find(params[:id])
        animal.update(animal_params)

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 5]]
---
    def destroy
        animal = Animal.find(params[:id])
        if animal.destroy