tracker_of_wildlife/app/controllers/sightings_controller.rb

    def index
        sightings = Sighting.all
---
SELECT "sightings".* FROM "sightings" WHERE (date >= '2013-08-05' AND date <= '2021-08-05')

    def create
        sighting = Sighting.create(sighting_params)
---
INSERT INTO "sightings" ("date", "latitude", "longitude", "animal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        sighting = Sighting.find(params[:id])
        sighting.update(sighting_params)
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "sightings" SET "animal_id" = $1, "updated_at" = $2 WHERE "sightings"."id" = $3  [["animal_id", 2], ["updated_at", "2020-08-05 23:42:06.210139"], ["id", 3]]

    def destroy
        sighting = Sighting.find(params[:id])
        if sighting.destroy
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "sightings" WHERE "sightings"."id" = $1  [["id", 4]]

    def report
        sightings = Sighting.where("date >= :start_date AND date <= :end_date",{start_date: params[:start_date], end_date: params[:end_date]})
---
SELECT "sightings".* FROM "sightings" WHERE (date >= '2013-08-05' AND date <= '2021-08-05')